In [1]:
# Importamos bibliotecas.
import pandas as pd

In [2]:
# Definimos rutas de archivos.
datasets = '../datasets/'
name = 'titanic/titanic3.csv'
path = datasets + name

In [3]:
# Definimos el dataframe.
df = pd.read_csv(path)

In [4]:
# Podemos ver los valores nulos de una columna con la función isnull.
pd.isnull(df['body'])

0        True
1        True
2        True
3       False
4        True
        ...
1304    False
1305     True
1306    False
1307     True
1308     True
Name: body, Length: 1309, dtype: bool

In [5]:
# Así mismo podemos ver los valores que no son nulos.
pd.notnull(df['body'])

0       False
1       False
2       False
3        True
4       False
        ...
1304     True
1305    False
1306     True
1307    False
1308    False
Name: body, Length: 1309, dtype: bool

In [6]:
# Podemos contar los valores nulos con lo siguiente.
pd.isnull(df['body']).sum()

np.int64(1188)

In [7]:
# Podemos eliminar líneas con valores 'nan' con el siguiente método.
# La opción how='all' para borrar las líneas/columnas con todas las entradas NaN,
# si how='any' borramos las líneas/columnas con al menos un NaN.
df.dropna(axis=0, how='any') # Podemos cambiar los NaN con valores usando el método '.fillna()'.

Empty DataFrame
Columns: [pclass, survived, name, sex, age, sibsp, parch, ticket, fare, cabin, embarked, boat, body, home.dest]
Index: []

In [8]:
# También podemos cambiar los NaN de una columna en particular.
df['body'] = df['body'].fillna(0) # cambia los NaN de la columna 'body' por '0'
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,0.0,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,0.0,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,0.0,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,0.0,"Montreal, PQ / Chesterville, ON"

In [9]:
# También podemos cambiar los NaN por el promedio, por ejemplo.
df['age'] = df['age'].fillna(df['age'].mean())
df['age']

0       29.000000
1        0.916700
2        2.000000
3       30.000000
4       25.000000
          ...
1304    14.500000
1305    29.881135
1306    26.500000
1307    27.000000
1308    29.000000
Name: age, Length: 1309, dtype: float64